app/Http/Controllers/Real_Estate_ObjectController.php

        public function index()
        {
            return view('properties.index', [
                'realEstateObjects' => Real_Estate_Object::latest()
                    ->filter(request(['tag', 'search']))
                    ->get()
            ]);
---
SELECT * FROM `real__estate__objects` ORDER BY `created_at` DESC

                    $fileName = time() . rand(1, 99) . '.' . $a[$i]->extension();
                    $a[$i]->move(public_path('uploads'), $fileName);
                    $formfields['url'] = 'uploads/'.$fileName;
                    RealEstateObjectImage::create($formfields);
---
INSERT INTO `realEstateObjectImages` (`real__estate__object_id`, `url`, `updated_at`, `created_at`) VALUES (10, 'uploads/167179663661.jpg', '2022-12-23 11:57:16', '2022-12-23 11:57:16')

        public function grid(Real_Estate_Object $realEstateObject) {
            return view('properties.grid', [
                'realEstateObjects' => Real_Estate_Object::latest()->get()
            ]);
---
SELECT * FROM `real__estate__objects` ORDER BY `created_at` DESC

        public function manage(Real_Estate_Object $realEstateObjects)
        {
            // pass anything to the view! [... => ... ,... => ...]
            return view('properties.manage', [
                'realEstateObjects' => auth()->user()->real_estate_objects()->get()
            ]);
---
SELECT * FROM `real__estate__objects` WHERE `real__estate__objects`.`user_id` = 1 and `real__estate__objects`.`user_id` IS not NULL